#список из квадратов целых чисел

'''n = 6
# a = [0] * n

# for i in range(n):
#     a[i] = i**2
# print(a)

a = [x ** 2 for x in range(n)]
print(a)'''

'''
a = [1 for x in range(5)] #[1, 1, 1, 1, 1] список из всех единиц
a = [x % 4 for x in range(7)] #[0, 1, 2, 3, 0, 1, 2] список из остатков от деления на 4
a = [x for x in range(11) if x % 2 == 0] #[0, 2, 4, 6, 8, 10] все четные числа в диапазоне
a = [x for x in range(-5, 5) if x < 0] #[-5, -4, -3, -2, -1] отрицательные числа из диапазона
a = [x for x in range(-6, 7) if x % 2 == 0 and x % 3 == 0] #[-6, 0, 6]

a = [x for x in 'python'] #['p', 'y', 't', 'h', 'o', 'n'] берем каждый символ из строки и записываем в список
a = [ord(x) for x in 'python'] #[112, 121, 116, 104, 111, 110] коды символов строки'''


#сформировать список из вводимых через пробел значений
'''d_inp = input("Put the numbers here: ")
a = [int(x) for x in d_inp.split()] #split() разбивает строку на список, а цикл превращает каждый эелемент в число
print(a)'''

#перебираем список по элементам и выводим эти эелементы == получаем такой же список
'''t = ['Я', 'б', 'Python', 'выучил', 'только', 'за', 'то', 'что', 'есть', 'он', 'на', 'этом', 'канале']
a = [x for x in a] #['Я', 'б', 'Python', 'выучил', 'только', 'за', 'то', 'что', 'есть', 'он', 'на', 'этом', 'канале']
a = [len(x) for x in t] #[1, 1, 6, 6, 6, 2, 2, 3, 4, 2, 2, 4, 6] длинны каждого элемента перебираемого списка'''

#выводим города, названия которых меньше 7 символов
'''cities = ['Москва', 'Тверь', 'Рязань', 'Ярославль', 'Владимир']
a = [x for x in cities if len(x) < 7]#['Москва', 'Тверь', 'Рязань']'''

#создаем список, где четный элемент = 'четное', а нечетный = 'нечетное'
'''d = [4, 3, -5, 0, 2, 11, 122, -8, 9]
a = ['четное' if x % 2 == 0 else 'нечетное' for x in d] #['четное', 'нечетное', 'нечетное', 'четное', 'четное', 'нечетное', 'четное', 'четное', 'нечетное']'''

#создадим список, где четный элемент = 'четное', а нечетный = 'нечетное' и только для положительных значений
'''d = [4, 3, -5, 0, 2, 11, 122, -8, 9]
a = ['четное' if x % 2 == 0 else 'нечетное'
     for x in d
     if x > 0
     ]
print(a) #['четное', 'нечетное', 'четное', 'нечетное', 'четное', 'нечетное']'''


'''n = 4
lst = []

for i in range(n):
    row = [0]*n
    lst.append(row)

for el in range(len(lst)):
    for e in range(len(lst[el])):
        if el == e:
            lst[el][e] = 1
        else:
            lst[el][e] = 0
print(lst)''' #[[1, 0, 0, 0], [0, 1, 0, 0], [0, 0, 1, 0], [0, 0, 0, 1]]

'''lst = [
    [1 if i == j else 0
     for i in range(n)]
    for j in range(n)]'''

'''n = 4
lst = []

for i in range(n):
    row = [0]*n
    lst.append(row)

for el in range(len(lst)):
    for e in range(len(lst[el])):
        lst[el][e] += el
    print(lst[el])''' #[[0, 0, 0, 0], [1, 1, 1, 1], [2, 2, 2, 2], [3, 3, 3, 3]]

#lst = [[j for i in range(n)] for j in range(n)]

#сложить числа двух списков между собой
'''s1 = [1, 2, 3, 4, 5]
s2 = [6, 7, 8, 9, 10]

s3 = []

for i in range(len(s1)):
    for j in range(len(s2)):
        if i == j:
            s3.append(s1[i]+s2[j])
print(s3) #[7, 9, 11, 13, 15]'''

#надо из данного списка сделать вот такой список: [['Москва', 15000], ['Уфа', 1200], ['Самара', 1090], ['Казань', 1300]]
'''lst = ['Москва', 15000, 'Уфа', 1200, 'Самара', 1090, 'Казань', 1300]
a = []
b = []
c = []

a = lst[0::2]
b = lst[1::2]

for i in range(len(a)):
    for j in range(len(b)):
        if i == j:
            c.append([a[i], b[j]]
print(c)'''
#c = [[lst[i], int(lst[i + 1])] for i in range(0, len(lst), 2)]

#разбить список на три части
'''lst = [1, 2, 3, 4, 5, 6, 7, 8, 9]

import math
rows = int(math.sqrt(len(lst)))#3 

s = [lst[i*rows:i*rows+rows] for i in range(rows)]
print(s) #[[1, 2, 3], [4, 5, 6], [7, 8, 9]]'''

